{
  "help": "مدد",
  "history": "تاریخ",
  "guide": "انوائس گائیڈ",
  "signIn": "سائن ان کریں",
  "signUp": "سائن اپ کریں",
  "brand": "انوائس-جنریٹر.com",
  "invoiceTemplate": "انوائس ٹیمپلیٹ",
  "creditNoteTemplate": "کریڈٹ نوٹ ٹیمپلیٹ",
  "quoteTemplate": "کوٹیشن ٹیمپلیٹ",
  "purchaseOrderTemplate": "خریداری آرڈر ٹیمپلیٹ",
  "invoicingGuide": "انوائسنگ گائیڈ",
  "developerApi": "ڈویلپر API",
  "releaseNotes": "ریلیز نوٹس",
  "termsOfService": "سروس کی شرائط",
  "privacyPolicy": "پرائیویسی پالیسی",
   "resources": "وسائل",
  "useInvoiceGenerator": "انوائس-جنریٹر استعمال کریں",
  "copyright": "© 2012–2025 انوائس-جنریٹر.com",
    "+ Add Your Logo": "+ اپنا لوگو شامل کریں",
  "Bill To": "بل بھیجیں",
  "Ship To": "ترسیل کریں",
  "Who is this to?": "یہ کس کے لیے ہے؟",
  "(optional)": "(اختیاری)",
  "INVOICE": "انوائس",
  "Payment Terms": "ادائیگی کی شرائط",
  "PO Number": "خریداری آرڈر نمبر",
  "Download Invoice": "انوائس ڈاؤن لوڈ کریں",
  "Preparing PDF...": "PDF تیار ہو رہا ہے...",
  "Currency": "کرنسی",
  "Save Default": "بطور طے شدہ محفوظ کریں",
  "Description of item/service...": "آئٹم/سروس کی تفصیل...",
  "Line Item": "لائن آئٹم",
  "Notes – any relevant information not already covered": "نوٹس – کوئی بھی متعلقہ معلومات جو شامل نہیں کی گئی ہو",
  "Terms and conditions – late fees, payment methods, delivery schedule": "شرائط و ضوابط – تاخیر کی فیس، ادائیگی کے طریقے، ترسیل کا شیڈول",
  "Subtotal": "جزوی رقم",
  "Tax": "ٹیکس",
  "Discount": "رعایت",
  "Shipping": "ترسیل",
  "Total": "کل",
  "Amount Paid": "ادا کی گئی رقم",
  "Balance Due": "بقایا رقم",
  "Who is this from?": "یہ کس کی طرف سے ہے؟",
      "Item": "آئٹم",
    "Quantity": "مقدار",
    "Rate": "شرح",
    "Amount": "رقم",
     "Notes": "نوٹس",
    "Terms": "شرائط",
    "Date": "تاریخ",
    "Due Date": "آخری تاریخ",
      "USD ($)": "USD (امریکی ڈالر)",
  "EUR (€)": "EUR (یورو)",
  "GBP (£)": "GBP (برطانوی پاؤنڈ)",
  "JPY (¥)": "JPY (جاپانی ین)",
  "CNY (¥)": "CNY (چینی یوآن)",
  "AUD (A$)": "AUD (آسٹریلوی ڈالر)",
  "CAD (C$)": "CAD (کینیڈین ڈالر)",
  "CHF (CHF)": "CHF (سوئس فرانک)",
  "INR (₹)": "INR (بھارتی روپیہ)",
  "PKR (₨)": "PKR (پاکستانی روپیہ)",
  "ZAR (R)": "ZAR (جنوبی افریقی رینڈ)",
  "SEK (kr)": "SEK (سویڈش کرونا)",
  "NOK (kr)": "NOK (نارویجن کرونا)",
  "DKK (kr)": "DKK (ڈینش کرونا)",
  "RUB (₽)": "RUB (روسی روبل)",
  "SGD (S$)": "SGD (سنگاپور ڈالر)",
  "HKD (HK$)": "HKD (ہانگ کانگ ڈالر)",
  "NZD (NZ$)": "NZD (نیوزی لینڈ ڈالر)",
  "THB (฿)": "THB (تھائی بھات)",
  "MYR (RM)": "MYR (ملائیشین رنگٹ)",
  "SAR (﷼)": "SAR (سعودی ریال)",
   "#": "#",
  "Invoice Number": "انوائس نمبر",
   "CREDIT NOTE": "کریڈٹ نوٹ",
  "QUOTE": "اقتباس",
 "PURCHASE": "خریداری",
  
  "Creating...": "تخلیق ہو رہا ہے...",
  "Create Invoice": "انوائس بنائیں",
"myInvoices": "میرے بل",
  "upgrade": "اپ گریڈ کریں",
  "History": "تاریخ",
  "HistoryDesc": "ہم حال ہی میں بنائے گئے بل خودکار طور پر آپ کے آلے پر محفوظ کرتے ہیں۔ یہ جلدی ترمیم کے لیے مددگار ہے۔",
  "Search": "تلاش",
  "Export": "برآمد کریں",
  "New Invoice": "نیا بل",
  "CUSTOMER": "کسٹمر",
  "TYPE": "قسم",
  "REFERENCE": "حوالہ",
  "DATE": "تاریخ",
  "DUE DATE": "واجب الادا تاریخ",
  "TOTAL": "کل",
  "View": "دیکھیں",
  "No invoices match your search": "Нет счетов, соответствующих вашему запросу",
  "No invoices found": "Счета не найдены",
  "Erase Everything": "Удалить всё",
    "GuideTitle": "انوائسنگ گائیڈ",
  "GuideIntro": "فری لانسرز اور چھوٹے کاروباری مالکان کے لیے بنیادی انوائسنگ گائیڈ کا تعارف",
  "GuidePara1": "ہمارے جامع رہنما میں خوش آمدید، جو فری لانسرز اور چھوٹے کاروبار کے مالکان کے لیے انوائسنگ اور اکاؤنٹنگ کے عمل کو آسان بنانے کے لیے تیار کیا گیا ہے۔ ان اہم مہارتوں پر عبور حاصل کرنا اس بات کو یقینی بنانے کے لیے ضروری ہے کہ آپ کا کاروبار ہموار طریقے سے چلے، ادائیگیاں بروقت موصول ہوں، اور آپ کی مالی صحت برقرار رہے۔",
  "GuidePara2": "مؤثر انوائسنگ اور اکاؤنٹنگ نہ صرف آپ کے نقد بہاؤ کو محفوظ بناتی ہے، بلکہ یہ آپ کے کاروباری آپریشنز کی بصیرت بھی فراہم کرتی ہے، جس سے باخبر فیصلے کرنے اور حکمت عملی سے منصوبہ بندی کرنے میں مدد ملتی ہے۔",
  "GuidePara3": "آپ کے کاروبار کے اس اہم پہلو میں آپ کی مدد کے لیے، ہم اپنی ویب سائٹ کا مفت انوائس جنریٹر ٹول پیش کر رہے ہیں۔ یہ آسان اور صارف دوست ٹول پیشہ ورانہ نظر آنے والے انوائسز کی تخلیق کو آسان بناتا ہے، جنہیں آپ آسانی سے حسبِ ضرورت بنا سکتے ہیں، بھیج سکتے ہیں، ادائیگیوں کو ٹریک کر سکتے ہیں اور اپنے مالی معاملات کو مؤثر طریقے سے منظم کر سکتے ہیں۔",
  "GuidePara4": "چاہے آپ پہلی بار بلنگ کر رہے ہوں یا اپنے موجودہ عمل کو بہتر بنانا چاہتے ہوں، ہمارا مفت انوائس ٹیمپلیٹ آپ کا وقت بچانے اور مالیاتی انتظام میں انتظامی بوجھ کو کم کرنے کے لیے تیار کیا گیا ہے۔",
  "GuidePara5": "آئیے اس سفر کا آغاز ساتھ کریں — مالی تنظیم اور کامیابی کی طرف، بنیادی چیزوں سے شروع کرتے ہوئے مؤثر انوائسنگ اور بنیادی اکاؤنٹنگ اصولوں میں مہارت حاصل کرنے تک۔",
  "InvoiceGenerator": "انوائس جنریٹر",
  "SignIn": "سائن ان کریں",
  "WelcomeBack": "خوش آمدید!",
  "Email": "ای میل",
  "Password": "پاس ورڈ",
  "KeepMeLoggedIn": "مجھے لاگ ان رکھیں",
  "SigningIn": "سائن ان کیا جا رہا ہے...",
  "NoAccount": "کیا آپ کا کوئی اکاؤنٹ نہیں ہے؟",
  "SignUp": "رجسٹر ہوں",
  "CreateAccount": "مفت اکاؤنٹ بنائیں",
  "AccountBenefits": "Invoice-Generator.com اکاؤنٹ کے ساتھ مزید خصوصیات تک رسائی حاصل کریں۔",
  "FirstName": "پہلا نام",
  "LastName": "آخری نام",
  "AgreeTerms": "میں سروس کی شرائط سے اتفاق کرتا ہوں",
  "CreatingAccount": "اکاؤنٹ بنایا جا رہا ہے...",
  "AlreadyHaveAccount": "کیا آپ کے پاس پہلے سے اکاؤنٹ ہے؟",
  "MyInvoices": "میرے انوائسز",
  "NewInvoice": "نیا انوائس",
  "NewCreditNote": "نیا کریڈٹ نوٹ",
  "NewQuote": "نیا کوٹیشن",
  "Customer": "کسٹمر",
  "Reference": "حوالہ",
  "Dates": "تاریخ",
  "DueDates": "واجب الادا تاریخ",
  "Status": "حالت",
  "Totals": "کل",
  "Invoice": "انوائس",
  "Paid": "ادا شدہ",
  "Unpaid": "باقی",
  "Generating": "تیار کیا جا رہا ہے...",
  "DownloadPDF": "پی ڈی ایف ڈاؤن لوڈ کریں",
  "Edit": "ترمیم کریں",
  "MarkAsPaid": "ادا شدہ نشان زد کریں",
  "MarkAsUnpaid": "باقی نشان زد کریں",
  "Delete": "حذف کریں",
  "Upgrade": "اپ گریڈ کریں",
  "UpgradeDescription": "اشتہارات ہٹانے اور ادائیگی کے عمل کے اخراجات کم کرنے کے لیے Invoice-Generator.com کی رکنیت خریدیں۔",
  "Monthly": "ماہانہ",
  "Yearly": "سالانہ",
  "MostPopular": "سب سے زیادہ مقبول",
  "PerMonth": "ماہانہ",
  "Subscribe": "سبسکرائب کریں",
  "ThisIncludes": "اس میں شامل ہے:",
  "Starter": "ابتدائی",
  "Premium": "پریمیم",
  "NoAds": "بغیر اشتہار کے",
  "Fee0_6": "ادائیگی کے عمل کی فیس: 0.6%",
  "NoFee": "کوئی ادائیگی کی فیس نہیں",
  "StarterMonthlyDesc": "Invoice-Generator.com کے ابتدائی منصوبے کی رکنیت۔",
  "PremiumMonthlyDesc": "Invoice-Generator.com کے پریمیم منصوبے کی رکنیت۔",
  "StarterYearlyDesc": "Invoice-Generator.com کے ابتدائی منصوبے کی سالانہ رکنیت۔",
  "PremiumYearlyDesc": "Invoice-Generator.com کے پریمیم منصوبے کی سالانہ رکنیت۔",
   "HeroTitle": "مفت انوائس ٹیمپلیٹ",
  "HeroSubtitle": "صرف ایک کلک میں خوبصورت انوائس بنائیں!",
  "HeroParagraph1": "اصل انوائس جنریٹر میں خوش آمدید، جس پر لاکھوں افراد کا اعتماد ہے۔ انوائس جنریٹر آپ کو ہمارے پرکشش ٹیمپلیٹ کے ساتھ فوری طور پر انوائس بنانے کی سہولت دیتا ہے، وہ بھی براہ راست آپ کے براؤزر سے۔",
  "HeroParagraph2": "کیا ہم نے یہ ذکر کیا کہ انوائس جنریٹر آپ کو لامحدود تعداد میں انوائسز بنانے کی سہولت دیتا ہے؟",
  "HeroCTA": "ٹھیک ہے، سمجھ گیا!",
    "Go to Home": "ہوم پر جائیں",
  "Help": "مدد",
  "HelpPageIntro": "انوائس جنریٹر ایک انوائس ٹیمپلیٹ فراہم کرتا ہے جو آپ کو ایک کلک میں پیشہ ورانہ انوائسز بنانے کی سہولت دیتا ہے۔ تیار کردہ انوائسز کو آن لائن بھیجا اور ادا کیا جا سکتا ہے۔",

  "Why use Invoice Generator?": "انوائس جنریٹر کیوں استعمال کریں؟",
  "Instant Invoices": "1. فوری انوائسز",
  "Instant Invoices Desc": "ہم نے انوائس بنانے کا تیز ترین طریقہ تیار کیا ہے ہمارے انوائس ٹیمپلیٹ کے ذریعے۔",
  "Invoice from any device": "2. کسی بھی ڈیوائس سے انوائس",
  "Invoice from any device Desc": "کسی بھی ڈیوائس (ڈیسک ٹاپ، ٹیبلٹ، یا اسمارٹ فون) سے چلتے پھرتے انوائس بنائیں۔",
  "Trusted by millions": "3. لاکھوں صارفین کا اعتماد",
  "Trusted by millions Desc": "ہر ماہ لاکھوں انوائسز انوائس جنریٹر پر بنائی جاتی ہیں۔",
  "100% FREE": "4. 100٪ مفت",
  "100% FREE Desc": "کوئی حد نہیں۔ جتنا چاہیں استعمال کریں۔",
  "Why use Invoice Generator Desc": "Invoice‑Generator.com کا مقصد انوائسنگ کو جتنا ممکن ہو آسان بنانا ہے۔",

  "How do I use Invoice Generator?": "انوائس جنریٹر کو کیسے استعمال کریں؟",

  "Making Invoices": "انوائسز بنانا",
  "Making Invoices Desc": "انوائس بنانا آسان ہے! اپنی تفصیلات کے ساتھ انوائس ٹیمپلیٹ کو مکمل کریں۔",
  "Download Disabled Info": "جب تک آپ اپنی معلومات نہیں بھرتے، انوائس ڈاؤن لوڈ کا بٹن غیر فعال رہے گا۔",

  "Sending Invoices": "انوائسز بھیجنا",
  "Sending Invoices Desc": "انوائسز کو ایسے صارفین کو بھیجا جا سکتا ہے جن کے پاس Invoice‑Generator.com اکاؤنٹ ہو۔ آپ کی انوائسز کلاؤڈ میں محفوظ طریقے سے ذخیرہ ہوتی ہیں، اور آپ مختلف ادائیگی کے طریقے قبول کر سکتے ہیں۔",
  "Learn More": "مزید جانیں",

  "Payments": "ادائیگیاں",
  "Payments Desc": "اگر آپ انوائس بھیجنے کی خصوصیت استعمال کر رہے ہیں، تو آپ اپنے خریدار سے بینک اکاؤنٹ یا کریڈٹ/ڈیبٹ کارڈ سے ادائیگی وصول کر سکتے ہیں۔ آپ اپنی انوائس میں متبادل ادائیگی کے طریقوں کی ہدایات بھی شامل کر سکتے ہیں۔",

  "Downloading Invoices": "انوائسز ڈاؤن لوڈ کرنا",
  "Downloading Invoices Desc": "انوائس کا PDF حاصل کرنے کے لیے 'انوائس ڈاؤن لوڈ کریں' پر کلک کریں۔ اگر کوئی غلطی ہو جائے تو پریشان نہ ہوں، آپ 'اس انوائس کو ایڈٹ کریں' پر کلک کر کے واپس جا سکتے ہیں اور اسے اپڈیٹ کر سکتے ہیں۔ اگر فائل نظر نہ آئے تو ڈاؤن لوڈز فولڈر چیک کریں۔",

  "Saving Invoices": "انوائسز محفوظ کرنا",
  "Saving Invoices Desc": "جو انوائسز آپ ڈاؤن لوڈ یا بھیجتے ہیں وہ خود بخود آپ کے آلے کی لوکل اسٹوریج میں محفوظ ہو جاتی ہیں۔ اس سے آپ پرانی انوائسز کو دوبارہ ایڈٹ کر سکتے ہیں۔\n\nآپ پچھلی انوائسز کو ہسٹری پیج پر دیکھ سکتے ہیں۔ کسی انوائس پر کلک کریں تاکہ وہ ایڈیٹر میں کھل جائے۔ آپ اپنی تمام انوائسز کو اسپریڈشیٹ میں ایکسپورٹ بھی کر سکتے ہیں۔\n\nکسی بھی انوائس کو ختم کرنے کے لیے اس پر ماؤس لے جائیں اور X پر کلک کریں۔ 'سب کچھ مٹا دیں' پر کلک کرنے سے تمام محفوظ شدہ انوائسز اور کسٹم ٹیمپلیٹ سیٹنگز مٹ جائیں گی۔",

  "Customizing the Invoice Template": "انوائس ٹیمپلیٹ کو حسبِ ضرورت بنانا",
  "Customizing Desc": "اگر آپ باقاعدگی سے Invoice Generator استعمال کرتے ہیں، تو آپ اپنی ٹیمپلیٹ سیٹنگز محفوظ کر سکتے ہیں۔ اپنی انوائس مکمل کرنے کے بعد دائیں سائیڈبار میں 'ٹیمپلیٹ محفوظ کریں' پر کلک کریں۔ اب ہر بار جب آپ Invoice Generator استعمال کریں گے، آپ کی ذاتی ٹیمپلیٹ لوڈ ہو گی۔\n\nٹیمپلیٹ آپ کی درج ذیل معلومات کو یاد رکھے گی:",
  "From Address": "مرسل کا پتہ",
  "Logo": "لوگو",
  "Currency": "کرنسی",
  "Terms": "شرائط",
  "Notes": "نوٹس",
  "Field Titles": "فیلڈ کے عنوانات",

  "System Requirements": "سسٹم کی ضروریات",
  "Browser Requirement": "Invoice Generator استعمال کرنے کے لیے ان میں سے کوئی ایک براؤزر درکار ہے:",
  "Google Chrome: latest two versions": "گوگل کروم: تازہ ترین دو ورژنز",
  "Mozilla Firefox: latest two versions": "موزیلا فائر فاکس: تازہ ترین دو ورژنز",
  "Apple Safari: latest two versions": "ایپل سفاری: تازہ ترین دو ورژنز",
  "Microsoft Edge: latest two versions": "مائیکروسافٹ ایج: تازہ ترین دو ورژنز",
  "Internet Explorer 11": "انٹرنیٹ ایکسپلورر 11",
  "Browser Settings": "براؤزر کی درج ذیل سیٹنگز فعال ہونی چاہئیں:",
  "Javascript enabled": "جاوا اسکرپٹ فعال",
  "Local storage enabled": "لوکل اسٹوریج فعال",
  "TLS v1.2 or above": "TLS v1.2 یا اس سے اوپر",

  "Where does Invoice Generator store invoices?": "Invoice Generator انوائسز کہاں محفوظ کرتا ہے؟",
  "Send Invoice feature": "انوائس بھیجنے کی خصوصیت",
  "Send Invoice Desc": "اگر آپ نے 'انوائس بھیجیں' آپشن استعمال کیا ہے تو آپ یا وصول کنندہ کسی بھی وقت انوائس تک رسائی حاصل کر سکتے ہیں",
  "signing in to Invoice-Generator.com": "Invoice‑Generator.com میں سائن ان کر کے",
  "Download Invoice feature": "انوائس ڈاؤن لوڈ کی خصوصیت",
  "Download Invoice Desc": "Invoice Generator آپ کے براؤزر کی لوکل اسٹوریج کا استعمال کرتا ہے تاکہ انوائسز کو یاد رکھے... حذف ہو جانے کے بعد انہیں واپس نہیں لایا جا سکتا۔",

  "What's new?": "کیا نیا ہے؟",
  "Read the": "پڑھیں",
  "Release Notes": "ریلیز نوٹس",
  "to see the latest invoicing features we've added.": "تاکہ آپ دیکھ سکیں ہم نے کون سی نئی انوائس خصوصیات شامل کی ہیں۔",

  "Invoice Generator API": "انوائس جنریٹر API",
  "API Desc": "انوائس ٹیمپلیٹ سیٹ اپ کرنے اور PDF بنانے کی جھنجھٹ سے بچیں۔ ہماری سروس آپ کے کوڈ سے تیز، خوبصورت انوائسز بنانے کے لیے ایک سادہ انٹرفیس فراہم کرتی ہے۔",
  "API Documentation": "API ڈاکیومنٹیشن",
   "Release Notes": "ریلیز نوٹس",
  "Read about the latest changes and improvements to help you send invoices faster.": "تازہ ترین تبدیلیوں اور بہتریوں کے بارے میں پڑھیں جو آپ کو تیزی سے انوائس بھیجنے میں مدد دیں گی۔",
  "Invoicing Guide": "انوائسنگ گائیڈ",

  "ReleaseNote.2024-06-05": "اب آپ سائن ان ہونے کے بعد اگلے انوائس نمبر کو تبدیل کر سکتے ہیں۔",
  "ReleaseNote.2024-06-02": "Invoice-Generator.com میں کئی نئی زبانیں شامل کی گئی ہیں، جن سے اب کل 16 زبانوں کی حمایت حاصل ہے۔",
  "ReleaseNote.2024-05-27": "کلاؤڈ موڈ متعارف! جب آپ مفت اکاؤنٹ سے سائن ان کرتے ہیں تو آپ کی انوائسز کلاؤڈ میں محفوظ اور تمام ڈیوائسز پر خودکار طور پر ہم آہنگ ہو جاتی ہیں۔",
  "ReleaseNote.2024-04-23": "خریداری کے آرڈر کا سانچہ شامل کیا گیا۔",
  "ReleaseNote.2024-04-05": "Invoice Generator نے نیا برانڈنگ حاصل کر لیا ہے! اس خوشی میں ڈارک موڈ بھی شامل کر دیا گیا ہے۔",
  "ReleaseNote.2024-03-08": "انوائس ہسٹری پیج کا نیا ڈیزائن متعارف کیا گیا ہے جو مزید معلومات دکھاتا ہے۔ کوٹیشن اور کریڈٹ نوٹ کے سانچے بھی شامل کیے گئے ہیں۔",
  "ReleaseNote.2022-03-07": "انوائس سانچے کی کرنسی فہرست کو جدید ISO کرنسیوں کے مطابق اپ ڈیٹ کیا گیا۔",
  "ReleaseNote.2021-09-13": "اب آپ انوائسز میں کوئی بھی ادائیگی لنک شامل کر سکتے ہیں جب Send Invoice کا آپشن استعمال کیا جائے۔",
  "ReleaseNote.2021-09-01": "انوائس سانچے میں اب ایک اختیاری PO نمبر فیلڈ شامل ہے تاکہ خریدار کے آرڈر کو ریفرنس کیا جا سکے۔",
  "ReleaseNote.2021-08-25": "کیا آپ کو ای-انوائس بھیجنی ہے؟ اب آپ UBL (یونیورسل بزنس لینگوئج) فارمیٹ میں انوائس بنا سکتے ہیں۔",
  "ReleaseNote.2020-05-17-1": "انوائس سانچے میں ایک اختیاری Ship To فیلڈ شامل کی گئی ہے۔",
  "ReleaseNote.2020-05-17-2": "Invoice Generator اب فرانسیسی، جرمن اور ہسپانوی زبانوں میں دستیاب ہے۔",
  "ReleaseNote.2020-05-16": "مختلف کرنسیوں کے لیے رقوم کی فارمیٹنگ بہتر بنائی گئی ہے، جو اب آپ کے براؤزر کی مقامی سیٹنگ کے مطابق ظاہر ہوتی ہے۔",
  "ReleaseNote.2018-07-30": "ایپ میں مختلف بگز درست کیے گئے۔ Invoice Generator اب دنیا بھر میں لاکھوں لوگ استعمال کر رہے ہیں۔ آپ کی حمایت کا شکریہ!",
  "ReleaseNote.2018-03-05": "PDF انوائس میں رقم کی فارمیٹنگ اب زیادہ مستقل ہے۔",
  "ReleaseNote.2017-11-30": "انوائس ای میل ٹیمپلیٹ بہتر بنایا گیا ہے۔ اب ای میل میں بھیجنے والے کی مزید معلومات شامل کی گئی ہیں۔",
  "ReleaseNote.2016-12-22": "ہمارا نیا نوٹس پڑھیں",
  "ReleaseNote.2016-09-12": "’ادائیگی کی شرائط‘ کا فیلڈ شامل کر دیا گیا۔",
  "ReleaseNote.2015-11-25": "نئے ادائیگی کے اختیارات! اب آپ Venmo اور Square Cash کے ذریعے بھی ادائیگیاں وصول کر سکتے ہیں۔ پہلے صرف PayPal دستیاب تھا۔",
  "ReleaseNote.2015-10-23": "انوائس سانچے کا انٹرفیس بہتر اور صاف کر دیا گیا ہے تاکہ آپ جلدی سے انوائس تیار کر سکیں۔",
  "ReleaseNote.2015-08-28": "اگر انوائس ای میل کچھ گھنٹوں بعد واپس آ جائے تو ہم اب آپ کو الرٹ بھیجتے ہیں۔",
  "ReleaseNote.2015-07-13": "انوائس نمبرز اب خودکار طور پر تیار ہوتے ہیں۔ ہر نئی انوائس پچھلے نمبر میں ایک کا اضافہ کرتی ہے۔ حسب ضرورت نمبرز اب بھی قابل استعمال ہیں۔",
  "ReleaseNote.2015-06-27": "انوائسز کو اب ہسٹری پیج پر جا کر CSV فائل میں ایکسپورٹ کیا جا سکتا ہے۔",
  "ReleaseNote.2015-02-13": "Invoice Generator API لانچ ہو گیا ہے۔ مزید معلومات GitHub پر دستیاب ہیں۔",
  "ReleaseNote.2015-02-06": "انوائس بھیجنا مزید آسان ہو گیا ہے۔ Send Invoice فارم کو سادہ بنا دیا گیا ہے...",
  "ReleaseNote.2015-02-05": "ایک بالکل نیا انوائس ٹیمپلیٹ متعارف ہوا ہے! اب انوائسنگ مزید بہتر ہو گئی ہے...",
  "ReleaseNote.2014-11-14": "خوبصورت اعشاریے! انوائس ٹیمپلیٹ اب زیادہ واضح اعداد دکھاتا ہے۔",
  "ReleaseNote.2014-11-10": "انوائس ٹیمپلیٹ بہتر بنایا گیا۔ انٹرفیس کو ہموار اور زیادہ صارف دوست بنایا گیا۔",
  "ReleaseNote.2014-09-08": "سائٹ اب بطور ڈیفالٹ SSL کے ساتھ محفوظ ہے...",
  "ReleaseNote.2014-08-29": "اب آپ Bitcoin میں انوائس بنا سکتے ہیں! کئی نئی کرنسیاں شامل کی گئی ہیں...",
  "ReleaseNote.2014-05-07": "انوائس کے لیے ایک نیا اور بہتر سانچہ متعارف ہوا ہے، اور ای میل کے ذریعے بھیجنے کی قابلیت میں بہتری لائی گئی ہے۔",
  "ReleaseNote.2014-03-20": "نئی خصوصیات: ڈسکاؤنٹ اور شپنگ لائنز...",
  "ReleaseNote.2014-03-10": "Invoice Generator اب موبائل پر بھی کام کرتا ہے! سائٹ کو نیا ریسپانسیو ڈیزائن دیا گیا ہے۔",
  "ReleaseNote.2014-01-18": "PDF بنانے کے لیے dompdf کی جگہ wkhtmltopdf کا استعمال شروع کیا گیا ہے۔ اس سے رفتار بہتر اور فائل سائز کم ہوا ہے۔",
  "ReleaseNote.2014-01-15": "‘From’ اور ‘Client’ فیلڈز پر لیبلز لگا دیے گئے۔ لمبے لوگو کا سائز درست نہ ہونے کا مسئلہ حل کیا گیا۔",
  "ReleaseNote.2013-12-03": "غلط لوگو کے لیے ایرر پیغامات بہتر بنائے گئے اور صفحہ لوڈ کرنے کی رفتار میں اضافہ کیا گیا۔",
  "ReleaseNote.2013-09-25": "ایسا بگ درست کیا گیا جس سے کچھ کرنسی کے سمبل غلط دکھائی دیتے تھے۔",
  "ReleaseNote.2013-07-31": "ایسا مسئلہ درست کیا گیا جس میں PDF خراب متن کے ساتھ بنتی تھی...",
  "ReleaseNote.2013-07-28": "لمبی نوٹس اب اگلے صفحے پر منتقل ہو جاتی ہیں۔ 'To' اور 'From' فیلڈز اب بائیں طرف سیدھ میں ہیں...",
  "ReleaseNote.2013-07-25": "لوگو کی فائل کا سائز 1MB تک محدود کر دیا گیا ہے...",
  "ReleaseNote.2013-07-16": "UI کو بہتر بنایا گیا اور وینزویلا بولیوار کرنسی میں شامل کی گئی۔",
  "ReleaseNote.2013-06-19": "ای میلز بھی اب خوبصورت ہیں! ای میل ٹیمپلیٹ کو بہتر اور تیز بنایا گیا۔",
  "ReleaseNote.2013-05-10": "مختلف بگز درست کیے گئے۔ تمام صارفین کا شکریہ جنہوں نے مسائل کی اطلاع دی۔",
  "ReleaseNote.2013-05-07": "Invoice Generator اب بین الاقوامی تاریخ فارمیٹ (d/m/y) کو سپورٹ کرتا ہے۔",
  "ReleaseNote.2013-05-01": "'ادا شدہ رقم' کو غلطی سے اوپر گول کرنے کا بگ درست کیا گیا۔",
  "ReleaseNote.2013-04-30": "اب انوائس PDF Unicode کو سپورٹ کرتا ہے۔ لوگو ہٹانے کے لیے نیا بٹن شامل کیا گیا ہے۔",
  "ReleaseNote.2013-04-26": "انوائسز اب آپ کے براؤزر کی مقامی اسٹوریج میں محفوظ ہو جاتی ہیں...",
  "ReleaseNote.2013-03-24": "انوائس ٹیمپلیٹ کو بہتر بنایا گیا ہے۔ اب آپ سائٹ سے ہی انوائس کو PDF اٹیچمنٹ کے طور پر ای میل کر سکتے ہیں۔",
  "ReleaseNote.2013-01-15": "Invoice Generator کو مکمل طور پر نئے انداز میں ڈیزائن کیا گیا ہے...",
  "ReleaseNote.2012-06-06": "لانچ!",
   "January": "جنوری",
  "February": "فروری",
  "March": "مارچ",
  "April": "اپریل",
  "May": "مئی",
  "June": "جون",
  "July": "جولائی",
  "August": "اگست",
  "September": "ستمبر",
  "October": "اکتوبر",
  "November": "نومبر",
  "December": "دسمبر",
   "Invoice Generator API": "انوائس جنریٹر API",
  "We created a simple API at Invoice-Generator.com to generate invoice PDFs on the fly. This service has been used internally by us for some time. We believe this could be helpful in your project as well.": "ہم نے Invoice-Generator.com پر ایک سادہ API بنایا ہے تاکہ فوری طور پر انوائس PDF تیار کی جا سکے۔ یہ سروس ہم خود کافی عرصے سے اندرونی طور پر استعمال کر رہے ہیں۔ ہمیں یقین ہے کہ یہ آپ کے پراجیکٹ میں بھی مفید ثابت ہو سکتی ہے۔",
  "The API has a primary endpoint that returns a PDF given details of an invoice. We don't store any of your invoice data.": "یہ API ایک بنیادی اینڈپوائنٹ فراہم کرتی ہے جو انوائس کی تفصیلات دینے پر PDF واپس کرتی ہے۔ ہم آپ کا کوئی بھی ڈیٹا محفوظ نہیں کرتے۔",
  "In addition to PDF, the API can also generate e-invoices in UBL (Universal Business Language) with the invoice PDF embedded. This is useful as the world shifts to e-invoicing because UBL invoices are tricky to generate.": "PDF کے علاوہ، یہ API UBL (یونیورسل بزنس لینگویج) میں ای-انوائسز بھی تیار کر سکتی ہے، جن میں PDF شامل ہوتا ہے۔ یہ اس وقت خاص طور پر مفید ہے جب دنیا ای-انوائسنگ کی طرف جا رہی ہے کیونکہ UBL انوائس تیار کرنا مشکل ہوتا ہے۔",
  "Use Cases": "استعمال کی صورتیں",
  "Creating invoices for VAT compliance": "وی اے ٹی کی تعمیل کے لیے انوائس تیار کرنا",
  "Generate a PDF of an invoice that you have the details to (recipient, line items, etc)": "انوائس کی تفصیلات (وصول کنندہ، اشیاء، وغیرہ) سے PDF بنائیں",
  "Produce invoices for B2B buyers from an order or receipt": "B2B خریداروں کے لیے آرڈر یا رسید سے انوائس تیار کریں",
  "Selling products or services on credit terms": "کریڈٹ شرائط پر مصنوعات یا خدمات فروخت کرنا",
  "Creating e-invoices in UBL (Universal Business Language)": "UBL (یونیورسل بزنس لینگویج) میں ای-انوائسز تیار کرنا",
  "Table of Contents": "فہرستِ مضامین",
  "Getting Started": "شروع کریں",
  "Examples": "مثالیں",
  "Simple Invoice": "سادہ انوائس",
  "JSON Input": "JSON ان پٹ",
  "VAT Invoice": "وی اے ٹی انوائس",
  "Localization": "مقامی ترجمہ",
  "Custom Fields": "حسب ضرورت فیلڈز",
  "E-invoice": "ای-انوائس",
  "Sample Projects": "نمونہ منصوبے",
  "API Reference": "API حوالہ",
  "Create Invoice PDF": "انوائس PDF تیار کریں",
  "Create E-invoice": "ای-انوائس تیار کریں",
  "Support": "مدد",
  "In order to begin using the Invoice-Generator.com API, you first need to create an API key. The process for obtaining an API key is as follows.": "Invoice-Generator.com API استعمال کرنے کے لیے، سب سے پہلے آپ کو API کلید حاصل کرنی ہوگی۔ طریقہ کار درج ذیل ہے:",
  "Create a free Invoice-Generator.com account": "Invoice-Generator.com پر مفت اکاؤنٹ بنائیں",
  "here": "یہاں",
  ", or sign in if you already have one.": "، یا اگر پہلے سے اکاؤنٹ موجود ہے تو سائن ان کریں۔",
  "Go to the Settings page.": "سیٹنگز کے صفحے پر جائیں۔",
  "In the \"API Keys\" section, click New API Key.": "\"API Keys\" سیکشن میں، 'نیا API کلید' پر کلک کریں۔",
  "Now you have an API key and are ready to start invoicing!": "اب آپ کے پاس API کلید ہے اور آپ انوائس بنانے کے لیے تیار ہیں!",
  "The free API plan has a limit of 100 invoices per month. In order to generate more invoices you will need to purchase an API subscription.": "مفت API منصوبہ ہر ماہ 100 انوائسز تک محدود ہے۔ مزید انوائسز تیار کرنے کے لیے سبسکرپشن درکار ہوگی۔",
  "\"Authorization: Bearer myApiKey\"": "\"Authorization: Bearer myApiKey\"",
  "from=\"Nikolaus Ltd\"": "from=\"Nikolaus Ltd\"",
  "to=\"Acme, Corp.\"": "to=\"Acme, Corp.\"",
  "logo=\"https://example.com/img/logo-invoice.png\"": "logo=\"https://example.com/img/logo-invoice.png\"",
  "number=1": "number=1",
  "date=\"Feb 9, 2015\"": "date=\"09 فروری 2015\"",
  "due_date=\"Feb 16, 2015\"": "due_date=\"16 فروری 2015\"",
  "\"items[0][name]\"=\"Starter plan monthly\"": "\"items[0][name]\"=\"ابتدائی پلان - ماہانہ\"",
  "\"items[0][quantity]\"=1": "\"items[0][quantity]\"=1",
  "\"items[0][unit_cost]\"=99": "\"items[0][unit_cost]\"=99",
  "notes=\"Thanks for being an awesome customer!\"": "notes=\"ہماری بہترین گاہک بننے کا شکریہ!\"",
  "terms=\"Please pay by the due date.\"": "terms=\"براہ کرم مقررہ تاریخ تک ادائیگی کریں۔\"",
  "Here's a simple cURL example for generating invoices with VAT:": "وی اے ٹی کے ساتھ انوائس تیار کرنے کے لیے ایک سادہ cURL مثال:",
  "from=\"Nikolaus Ltd%0AVAT ID: 1234\"": "from=\"Nikolaus Ltd%0AVAT ID: 1234\"",
  "payment_terms=\"Charged - Do Not Pay\"": "payment_terms=\"چارج کیا گیا - ادائیگی نہ کریں\"",
  "tax_title=\"VAT\"": "tax_title=\"وی اے ٹی\"",
  "\"fields[tax]\"=\"%\"": "\"fields[tax]\"=\"%\"",
  "tax=8": "tax=8",
  "terms=\"No need to submit payment. You will be auto-billed for this invoice.\"": "terms=\"ادائیگی کی ضرورت نہیں۔ یہ انوائس خود بخود چارج کر دی جائے گی۔\"",
  "JSON input is also accepted with the Content-Type header set to application/json": "اگر Content-Type 'application/json' پر سیٹ ہو تو JSON ان پٹ بھی قابل قبول ہے۔",
  "It is possible to change the localization used to generate the invoice by supplying a locale in the Accept-Language header. The default locale is en-US.": "Accept-Language ہیڈر میں لوکل سیٹ کر کے انوائس کی زبان تبدیل کی جا سکتی ہے۔ ڈیفالٹ زبان en-US ہے۔",
  "\"Accept-Language: fr-FR\"": "\"Accept-Language: fr-FR\"",
  "to=\"Acme Corp.\"": "to=\"Acme Corp.\"",
  "We currently have translations available in English, French, German, Spanish, and Thai.": "اس وقت ترجمے انگلش، فرانسیسی، جرمن، ہسپانوی اور تھائی زبان میں دستیاب ہیں۔",
  "to=\"My Customer\"": "to=\"میرا صارف\"",
  "ship_to=\"Shipping Address\"": "ship_to=\"ترسیل کا پتہ\"",
  "\"custom_fields[0][name]\"=\"My Custom Field\"": "\"custom_fields[0][name]\"=\"میرا حسب ضرورت فیلڈ\"",
  "\"custom_fields[0][value]\"=\"Some Value\"": "\"custom_fields[0][value]\"=\"کچھ قدر\"",
  "Here's a simple cURL example for generating e-invoices in UBL XML:": "UBL XML میں ای-انوائس تیار کرنے کی ایک سادہ cURL مثال:",
  "to=\"Foster Moen%0AVAT ID: 4567\"": "to=\"Foster Moen%0AVAT ID: 4567\"",
  "date=\"Mar 9, 2015\"": "date=\"09 مارچ 2015\"",
  "payment_terms=\"NET 30\"": "payment_terms=\"NET 30\"",
  "Go": "جائیں",
  "generate invoices programmatically": "پروگرام کے ذریعے انوائس تیار کریں",
  "Ruby": "Ruby",
  "generate invoices from Stripe webhooks": "Stripe webhook سے انوائس تیار کریں",
  "URL of your logo": "آپ کے لوگو کا URL",
  "Your organization billing address and contact info": "آپ کی تنظیم کا بلنگ پتہ اور رابطہ معلومات",
  "Entity being billed – multiple lines ok": "جس ادارے کو انوائس بھیجی جا رہی ہے – ایک سے زیادہ لائنیں بھی چلیں گی",
  "Shipping address – multiple lines ok": "ترسیل کا پتہ – متعدد لائنیں قابل قبول",
  "Invoice number": "انوائس نمبر",
  "ISO 4217 3-digit currency code": "ISO 4217 کا 3 ہندسوں والا کرنسی کوڈ",
  "Array of objects – see Custom Fields below": "آبجیکٹ کی فہرست – نیچے حسب ضرورت فیلڈز دیکھیں",
  "Invoice date": "انوائس کی تاریخ",
  "current date": "موجودہ تاریخ",
  "Payment terms summary (i.e. NET 30)": "ادائیگی کی شرائط کا خلاصہ (مثلاً NET 30)",
  "Invoice due date": "انوائس کی آخری تاریخ",
  "Array of objects – see Line Items below": "آبجیکٹ کی فہرست – نیچے لائن آئٹمز دیکھیں",
  "Object – see Subtotal Lines below": "آبجیکٹ – نیچے سب ٹوٹل لائنز دیکھیں",
  "Subtotal discounts – numbers only": "سب ٹوٹل ڈسکاؤنٹ – صرف اعداد",
  "Tax – numbers only": "ٹیکس – صرف عدد",
  "Shipping – numbers only": "ترسیل – صرف عدد",
  "Amount paid – numbers only": "ادا کردہ رقم – صرف عدد",
  "Notes – any extra information not included elsewhere": "نوٹس – اضافی معلومات جو کہیں اور شامل نہیں",
  "Terms and conditions – all the details": "شرائط و ضوابط – تمام تفصیلات",
  "Node.js": "Node.js",
  "Python": "Python",
  "Invoice Parameters": "انوائس پیرامیٹرز",
  "When a value is null or zero, the field will not be shown on the invoice. The exception to this are the required fields": "اگر کوئی ویلیو صفر یا null ہو، تو وہ فیلڈ انوائس پر ظاہر نہیں ہوتی۔ صرف لازمی فیلڈز اس سے مستثنیٰ ہیں۔",
  "from": "بھیجنے والا",
  "to": "وصول کنندہ",
  "date": "تاریخ",
  "and": "اور",
  "items": "اشیاء",
  "PARAMETER": "پیرامیٹر",
  "DESCRIPTION": "تفصیل",
  "DEFAULT VALUE": "پہلے سے طے شدہ قیمت",
  "Line Item Parameters": "لائن آئٹم پیرامیٹرز",
  "Line items are represented as an array of objects. Here's an example:": "لائن آئٹمز کو آبجیکٹس کی فہرست کے طور پر ظاہر کیا جاتا ہے۔ یہ مثال دیکھیں:",
  "Subtotal Line Parameters": "سب ٹوٹل لائن کے پیرامیٹرز",
  "The": "یہ",
  "fields": "فیلڈز",
  "object toggles the discounts, tax, and shipping subtotal lines.": "آبجیکٹ ڈسکاؤنٹ، ٹیکس اور شپنگ کے سب ٹوٹل کو فعال یا غیر فعال کرتا ہے۔",
  "Each setting can have a value of": "ہر سیٹنگ کی ویلیو درج ذیل میں سے ہو سکتی ہے:",
  "true": "true",
  "false": "false",
  "For example:": "مثال کے طور پر:",
  "Custom Field Parameters": "حسب ضرورت فیلڈ پیرامیٹرز",
  "Custom fields allow you to add additional fields to the invoice details in the top-right. Example:": "حسب ضرورت فیلڈز آپ کو انوائس کی تفصیلات میں اوپر دائیں طرف اضافی فیلڈز شامل کرنے کی اجازت دیتی ہیں۔ مثال:",
  "Invoice Template Parameters": "انوائس ٹیمپلیٹ کے پیرامیٹرز",
  "These parameters control the titles of the fields on the invoice template. If localization is used, the default values are translated to the specified language. Any invoice template parameter given will override the localized default.": "یہ پیرامیٹر انوائس ٹیمپلیٹ پر فیلڈز کے عنوانات کو کنٹرول کرتے ہیں۔ اگر مقامی زبان کا ترجمہ فعال ہو تو یہ ویلیوز ترجمہ شدہ نظر آئیں گی، تاہم اگر کوئی کسٹم ویلیو دی جائے تو وہ ترجمے پر غالب آ جائے گی۔",
  "Parameters": "پیرامیٹرز",
  "Creating an invoice with Universal Business Language uses the same parameters as the": "UBL فارمیٹ میں انوائس بنانے کے لیے وہی پیرامیٹرز استعمال ہوتے ہیں جیسے:",
  "endpoint.": "اینڈ پوائنٹ۔",
  "Have a feature request or bug report? We would love to hear your thoughts! You can": "کوئی فیچر کی درخواست یا بگ رپورٹ کرنا چاہتے ہیں؟ ہم آپ کی رائے کا خیرمقدم کرتے ہیں! آپ",
  "create an issue": "ایک مسئلہ رپورٹ کریں",
  "on GitHub for any issues you encounter or feature requests.": "GitHub پر اپنی شکایات یا تجاویز جمع کروا سکتے ہیں۔",
  "Using invoice-generator.com is subject to the": "invoice-generator.com کا استعمال درج ذیل کا پابند ہے:",
  "Privacy Policy": "رازداری کی پالیسی",
  "Terms of Use": "استعمال کی شرائط",
  "logo": "لوگو",
  "URL of your logo": "آپ کے لوگو کا URL",
  "from": "سے",
  "Your organization billing address and contact info": "آپ کی تنظیم کا بلنگ ایڈریس اور رابطے کی معلومات",
  "to": "کو",
  "Entity being billed – multiple lines ok": "جس کو بل بھیجا جا رہا ہے - متعدد لائنز کی اجازت ہے",
  "ship_to": "شپنگ ایڈریس",
  "Shipping address – multiple lines ok": "شپنگ ایڈریس - متعدد لائنز کی اجازت ہے",
  "number": "نمبر",
  "Invoice number": "انوائس نمبر",
  "currency": "کرنسی",
  "ISO 4217 3-digit currency code": "آئی ایس او 4217 تین ہندسوں کا کرنسی کوڈ",
  "custom_fields": "کسٹم فیلڈز",
  "Array of objects – see Custom Fields below": "آبجیکٹس کی فہرست - نیچے دی گئی کسٹم فیلڈز دیکھیں",
  "date": "تاریخ",
  "Invoice date": "انوائس کی تاریخ",
  "current date": "موجودہ تاریخ",
  "payment_terms": "ادائیگی کی شرائط",
  "Payment terms summary (i.e. NET 30)": "ادائیگی کی شرائط کا خلاصہ (مثال: NET 30)",
  "due_date": "واجب الادا تاریخ",
  "Invoice due date": "انوائس کی واجب الادا تاریخ",
  "items": "اشیاء",
  "Array of objects – see Line Items below": "آبجیکٹس کی فہرست - نیچے دی گئی لائن آئٹمز دیکھیں",
  "fields": "فیلڈز",
  "Object – see Subtotal Lines below": "آبجیکٹ - نیچے دی گئی سب ٹوٹل لائنز دیکھیں",
  "tax": "ٹیکس",
  "%": "%",
  "discounts": "رعایتیں",
  "shipping": "شپنگ",
  "Subtotal discounts – numbers only": "جزوی رعایتیں - صرف اعداد",
  "Tax – numbers only": "ٹیکس - صرف اعداد",
  "Shipping – numbers only": "شپنگ - صرف اعداد",
  "amount_paid": "ادا شدہ رقم",
  "Amount paid – numbers only": "ادا شدہ رقم - صرف اعداد",
  "notes": "نوٹس",
  "Notes – any extra information not included elsewhere": "نوٹس - کوئی اضافی معلومات جو اور جگہ شامل نہ ہوں",
  "terms": "شرائط",
  "Terms and conditions – all the details": "شرائط و ضوابط - تمام تفصیلات",
  "null": "خالی",
  "0": "۰",
  "[]": "[]",
  "Supported Languages": "مدد شدہ زبانیں",
  "header": "ہیڈر",
  "INVOICE": "انوائس",
  "to_title": "وصول کنندہ",
  "Bill To": "بل بھیجیں",
  "ship_to_title": "شپنگ کے لیے",
  "Ship To": "شپنگ ایڈریس",
  "invoice_number_title": "انوائس نمبر",
  "#": "#",
  "date_title": "تاریخ",
  "Date": "تاریخ",
  "payment_terms_title": "ادائیگی کی شرائط",
  "Payment Terms": "ادائیگی کی شرائط",
  "due_date_title": "واجب الادا تاریخ",
  "Due Date": "واجب الادا تاریخ",
  "purchase_order_title": "خریداری آرڈر",
  "Purchase Order": "خریداری آرڈر",
  "quantity_header": "مقدار",
  "Quantity": "مقدار",
  "item_header": "آئٹم",
  "Item": "آئٹم",
  "unit_cost_header": "فی یونٹ قیمت",
  "Rate": "ریٹ",
  "amount_header": "رقم",
  "Amount": "رقم",
  "subtotal_title": "جزوی کل",
  "Subtotal": "جزوی کل",
  "discounts_title": "رعایتیں",
  "Discounts": "رعایتیں",
  "tax_title": "ٹیکس",
  "Tax": "ٹیکس",
  "shipping_title": "شپنگ",
  "Shipping": "شپنگ",
  "total_title": "کل",
  "Total": "کل",
  "amount_paid_title": "ادا شدہ رقم",
  "Amount Paid": "ادا شدہ رقم",
  "balance_title": "بقایا",
  "Balance": "بقایا",
  "terms_title": "شرائط",
  "Terms": "شرائط",
  "notes_title": "نوٹس",
  "Notes": "نوٹس"
}
